"""
Напишите программу, которая будет преобразовывать десятичное число в двоичное.
*Пример:*
- 45 -> 101101
- 3 -> 11
- 2 -> 10
"""

# def num_conversion():
#     num = int(input("Введите число: "))
#     print(f"num = {num:0b}")

# num_conversion()


# def num_conversion():
#     n = int(input("Введите число: "))
#     lst = []
#     while n > 0:
#         lst.append(str(n % 2))
#         n //= 2
#     return "".join(lst[::-1])

# print(num_conversion())
